## Plan Result (dev-global)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview"
        name                                         = "hmcts-preview"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (14 unchanged attributes hidden)

      ~ routing_rule {
            id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/hmi-apim"
            name               = "hmi-apim"
            # (4 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ cache_enabled                         = false -> true
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
            id                 = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview/routingRules/reformscan"
            name               = "reformscan"
            # (4 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ cache_enabled                         = false -> true
                # (5 unchanged attributes hidden)
            }
        }

        # (16 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/lz-preview-rg/providers/Microsoft.Network/frontDoors/hmcts-preview|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1359,"Program":"tfcmt","SHA1":"","Target":"dev-global","Vars":{}} -->